{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Bachelor of Science in Computer Science",
      "department": "College of Information and Technology",
      "duration": "2007-2011",
      "school_name": "Punjab University, Lahore, Pakistan"
    },
    {
      "awards_achievements": null,
      "degree": "Full Stack Java Development",
      "department": "IT",
      "duration": "June 2018-Sep 2018",
      "school_name": "Com IT, Winnipeg, Canada"
    },
    {
      "awards_achievements": null,
      "degree": "Quality Assurance: Manual and Automation Testing",
      "department": "IT",
      "duration": "Jan 2021-Apr 2021",
      "school_name": "Justwin IT Solutions, Brampton, Canada"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_AyeshaHamad",
  "highlighted_projects": [
    {
      "description": "Created Photo Editor app using C++ and OpenCV library. Added number of filters manipulating RBG pixels of the image with the help of OpenCV.",
      "git_url": "",
      "name": "Photo Editor - Filters and Effect"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Implemented a Monitoring Agent for the Linux admin team with Bash Scripts, PostgreSQL, PSQL Client Tool, Crontab, SQL queries, Docker, etc. The LCA team can get hardware specifications and software utilization like memory/CPU management and generate reports with the help of the data saved in the database and executing SQL queries. These reports will further help the LCA team decide whether they want to increase hardware/software specifications or not if the system is fully or underutilized.",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "JDBC App: Designed a 'Customer Order Processing System' using JDBC, Data Access Object (DAO), and Data Transfer Object (DTO) Design Pattern, Postgres SQL, PSQL Client Tool, Maven, Docker to create Psql container, IntelliJ, and DBeaver. I have used JDBC to access data from RDBMS. The advantage of JDBC is that an application created using JDBC can access a variety of relational databases and run on any platform with a Java Virtual Machine. In this application, you can read, write, update, and delete (CURD) data against an RDBMS database.",
        "Grep App: Created a program that simulates the Linux grep command searching for a specified text pattern in an input file. Implementation includes ArrayList, FileReader/FileWriter, BufferedReader/BufferedWriter, Regex Pattern, Maven, and Docker to dockerize and deploy the app. This program works in a way that it traverses the 'root directory' that you enter and looks for files and sub-directories further in it. Searches the entered string in all those files and saves all matching lines to a text file."
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    }
  ],
  "name": "Ayesha Hamad",
  "others": [
    {
      "bullets": [
        "Endorsed Automation Tester Certification",
        "Endorsed Manual Tester Certification",
        "Endorsed Scrum Tester Certification"
      ],
      "title": "Certifications"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "Working as a Software Developer, creating Java Applications using Core Java concepts, OOP, Data Structures, RDBMS/SQL, JDBC, Maven, etc. Implementing SCRUM and AGILE methodologies and appropriate SDLC, analyzing Business Requirements and Functional Specifications, identifying Test Scenarios, and deploying the application. ",
      "duration": "2021-present",
      "title": "Software Developer"
    },
    {
      "company": "FiveRivers Technologies, Lahore, Pakistan",
      "description": "Worked on Marmalade - a cross-platform for mobile application development using C++ and developed android and IOS applications. My basic dedication was creating the Photo Editor app in pepper.pk integrating openCV and photoshop algorithms to create filters. **Key Responsibilities:** Created Photo Editor App using Marmalade, for android and IOS. Created android and IOS extensions to add monetizations and other SDKs to marmalade platforms like Revmob, StartApp, Leadbolt, Google Ad mediation, Flurry, Crittercism using JNI, Java, Obj-C, and marmalade EDK (extension development kit). Maintained existing programs by modifying as required and making the code reusable. Wrote, modified, integrated, and tested software code. Wrote test cases for each module to ensure a bug-free and robust code. Gathered and Understood user requirements to develop logical specifications.",
      "duration": "2011-2014",
      "title": "Software Engineer"
    }
  ],
  "skills": {
    "competent": [
      "Unit and Integration Testing",
      "Test scripting using UFT (QTP)",
      "Selenium WebDriver (JAVA) implementing Page Object Model and TestNG",
      "ALM Octane (QC)",
      "Jira",
      "Manual Testing/Test cases"
    ],
    "familiar": [
      "Rest API",
      "Obj-C",
      "C# .Net",
      "SOAP UI - Testing Web Services",
      "Web designing"
    ],
    "proficient": [
      "Java",
      "C++",
      "OOP",
      "Data Structures",
      "Design Patterns",
      "Linux/Bash",
      "RDBMS/SQL",
      "JDBC",
      "Maven",
      "Docker",
      "SDLC",
      "Agile/Scrum",
      "Git/GitHub",
      "IntelliJ"
    ]
  },
  "summary": "I have done BS in Computer Science and have three years of programming experience in application development. I have also completed Full Stack Java Development and Software Automation Quality Assurance courses. To pursue my career further in Software Development, I also took some certifications; I am Certified Automation Tester and SCRUM Tester. What really excites me is that the Software industry is ruling the world, and I have always wanted to be a part of it. I like to code and develop applications and programs, and doing what you like most increases your creativity and productivity. I have good experience of SCRUM and AGILE methodologies. Skills in analyzing Business Requirements and Functional Specifications. Ability to identify, analyze and solve problems. I have excellent communication and interpersonal skills and am always willing to learn new technologies and adapting new environments."
}
