{
  "education": [
    {
      "awards_achievements": null,
      "degree": "Bachelor of Science in Computer Science",
      "department": "College of Information and Technology",
      "duration": "2007-2011",
      "school_name": "Punjab University, Lahore, Pakistan"
    },
    {
      "awards_achievements": null,
      "degree": "Full Stack Java Development",
      "department": "IT",
      "duration": "June 2018-Sep 2018",
      "school_name": "Com IT, Winnipeg, Canada"
    },
    {
      "awards_achievements": null,
      "degree": "Quality Assurance: Manual and Automation Testing",
      "department": "IT",
      "duration": "Jan 2021-Apr 2021",
      "school_name": "Justwin IT Solutions, Brampton, Canada"
    }
  ],
  "github_repo_root_url": "https://github.com/jarviscanada/jarvis_data_eng_AyeshaHamad",
  "highlighted_projects": [
    {
      "description": "ADD HERE LATER, WHICH PROJECT I WANT TO HIGHLIGHT Suspendisse posuere luctus aliquet. Quisque magna tellus, tempor vitae arcu sed, volutpat scelerisque lacus. Aliquam varius pulvinar dapibus. Ut a tincidunt sem. Aenean sollicitudin fringilla erat ut imperdiet. Phasellus fermentum, enim vitae laoreet elementum, eros nisl hendrerit lorem.",
      "git_url": "",
      "name": "Web app for resturant"
    }
  ],
  "jarvis_projects": [
    {
      "description": "Implemented a Monitoring Agent for Jarvis Linux Cluster (MVP), so that the LCA team can get hardware specifications and software utilization, memory/CPU management and generate reports. These reports will further help the LCA team to make decisions either they want to increase hardware/software specifications or not if the system is fully or under utilized. \n **Technologies used:** Docker, Bash scripts, Postgres SQL, PSQL Client Tool, Crontab, IntelliJ, Git and GitHub",
      "git_url": "/linux_sql",
      "name": "Cluster Monitor"
    },
    {
      "description": [
        "Twitter App:",
        "JDBC App:",
        "Grep App: Add here"
      ],
      "git_url": "/core_java",
      "name": "Core Java Apps"
    },
    {
      "description": "",
      "git_url": "/springboot",
      "name": "Springboot App"
    },
    {
      "description": "",
      "git_url": "/python_data_anlytics",
      "name": "Python Data Analytics"
    },
    {
      "description": "",
      "git_url": "/hadoop",
      "name": "Hadoop"
    },
    {
      "description": "",
      "git_url": "/spark",
      "name": "Spark"
    },
    {
      "description": "",
      "git_url": "/cloud_devops",
      "name": "Cloud/DevOps"
    }
  ],
  "name": "Ayesha Hamad",
  "others": [
    {
      "bullets": [
        "Endorsed Automation Tester Certification",
        "Endorsed Manual Tester Certification",
        "Endorsed Scrum Tester Certification"
      ],
      "title": "Certifications"
    }
  ],
  "professional_experience": [
    {
      "company": "Jarvis",
      "description": "ADD HERE FURTHER DETAIL Suspendisse a tincidunt odio. Suspendisse posuere luctus aliquet. Quisque magna tellus, tempor vitae arcu sed, volutpat scelerisque lacus. Aliquam varius pulvinar dapibus. Ut a tincidunt sem. Aenean sollicitudin fringilla erat ut imperdiet. Phasellus fermentum, enim vitae laoreet elementum, eros nisl hendrerit lorem.",
      "duration": "2021-present",
      "title": "Software Developer"
    },
    {
      "company": "FiveRivers Technologies, Lahore, Pakistan",
      "description": "Worked on Marmalade - a cross platform for mobile application development using C++ and developed android and IOS applications. My basic dedication was creating the Photo Editor app in pepper.pk integrating openCV and photo shop algorithms to create filters.\n \n **Key Responsibilities:** Created Photo Editor App using Marmalade, for android and IOS. Created android and IOS extensions to add monetization s and other SDKs to marmalade platform like Revmob, StartApp, Leadbolt, Google Ad mediation, Flurry, Crittercism using JNI, Java, Obj-C and marmalade EDK (extension development kit). Maintained existing programs by modifying as required and making the code reusable. Wrote, modified, integrated, and tested software code. Wrote test cases for each module to ensure a bug free and robust code. Gathered and Understood user requirements to develop logical specifications.",
      "duration": "2011-2014",
      "title": "Software Engineer"
    }
  ],
  "skills": {
    "competent": [
      "Test scripting using UFT (QTP)",
      "Selenium WebDriver (JAVA) implementing Page Object Model and TestNG",
      "ALM Octane (QC)",
      "Jira",
      "Manual Testing/Test cases"
    ],
    "familiar": [
      "Obj-C",
      "C# .Net",
      "Rest API",
      "SOAP UI - Web Services",
      "Web designing"
    ],
    "proficient": [
      "Java",
      "C++",
      "OOP",
      "Data Structures",
      "Linux/Bash",
      "RDBMS/SQL",
      "Agile/Scrum",
      "SDLC",
      "Git/GitHub"
    ]
  },
  "summary": "I have done BS in Computer Science and have 3 years of programming experience in C++ in mobile application development. I have also taken Full Stack Java Development Course from ComIT, Manitoba and Software Quality Assurance Course - Manual and Automation Teasting from JustWin, Ontario. To persue my career in Software Development and Testing field I also took some certifications, I am Certified Automation Tester, SCRUM Tester and Manual Tester. \n\n What really excites me is that IT industry is ruling the world and I always wanted to be the part of it. I like to code and develop apps and programs and doing what you like most increases your creativity and productivity as well. I have excellent communication and interpersonal skills and always willing to learn new technologies and adapting new environment"
}
